
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/17713626180)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.cwlogs1.aws_cloudwatch_log_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cwlogs1.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ap-northeast-1:644370126241:log-group:test-1" -> (known after apply)
      ~ id                = "test-1" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "test-1" -> "test-2" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"e8e236814e2e0effa19a3a0ca198a2e25b323ceb","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->